"no_explosions"
"seven_out"
"torn_in"
"particular_one"
"recommended_only"
"are_behind"
"evil_breed"
"extremely_entertaining"
"only_disappointment"
"brisk_pace"
"quite_disappointed"
"four_title"
"the_comfort"
"endearingly"
"lamer"
"lone_star"
"claptrap"
"only_flaw"
"costly"
"dull_moment"
"is_seven"
"no_bad"
"grade_c"
"only_negative"
"fundamentalist"
"boring_or"
"never_boring"
"uninvolving"
"interminable"
"leaden"
"mansfield"
"own_risk"
"watchable_but"
"blew_me"
"grade_b"
"negative_comments"
"this_travesty"
"not_disappointed"
"lost_interest"
"wanting_more"
"so_disappointed"
"me_sick"
"a_disgrace"
"bad_reviews"
"is_fast"
"just_enjoy"
"little_else"
"little_slow"
"might_enjoy"
"his_grave"
"total_lack"
"blown_up"
"only_complaint"
"potential_but"
"or_hate"
"hairy"
"vapid"
"fine_film"
"unappealing"
"something_better"
"only_saving"
"plus_side"
"grade_d"
"the_monkees"
"had_high"
"stereotyped"
"is_supposedly"
"very_moving"
"deliciously"
"good_show"
"just_great"
"letdown"
"moves_along"
"excellently"
"what_exactly"
"skip_it"
"cerebral"
"flimsy"
"absorbing"
"walking_around"
"definitely_recommend"
"embarrassingly"
"a_difficult"
"few_laughs"
"wider"
"detract"
"wouldn't_recommend"
"neatly"
"not_recommended"
"turd"
"one_star"
"very_slow"
"has_everything"
"even_close"
"tolerable"
"glued"
"below_average"
"i_lost"
"just_wasn't"
"fell_asleep"
"surprisingly_good"
"wrenching"
"only_problem"
"thumbs_up"
"this_turkey"
"main_problem"
"of_laughs"
"inaccurate"
"unlikeable"
"yawn"
"can_relate"
"be_missed"
"miss_it"
"olds"
"check_this"
"restored"
"complaints"
"muddled"
"simplicity"
"bravo"
"i'm_afraid"
"cash_in"
"doesn't_help"
"very_enjoyable"
"spot_on"
"for_once"
"started_out"
"tiresome"
"sub_par"
"just_seems"
"is_okay"
"look_forward"
"don't_miss"
"embarrassment"
"for_free"
"inappropriate"
"cleverly"
"really_wanted"
"stilted"
"stock_footage"
"very_disappointed"
"bad_thing"
"riveting"
"just_isn't"
"was_disappointed"
"disappoint"
"downhill"
"an_enjoyable"
"little_film"
"pleasantly_surprised"
"save_your"
"guys_and"
"of_talent"
"not_recommend"
"unintentional"
"should_see"
"skip_this"
"too_seriously"
"fast_paced"
"ideal"
"walked_out"
"how_good"
"interesting_but"
"an_insult"
"stinker"
"unwatchable"
"draws"
"first_rate"
"i_hated"
"disjointed"
"save_this"
"my_money"
"worthless"
"sadistic"
"flawless"
"fears"
"insulting"
"pleased"
"that's_about"
"this_mess"
"was_looking"
"heart_and"
"incoherent"
"superbly"
"cried"
"holly"
"isn't_even"
"my_only"
"let_down"
"to_recommend"
"too_hard"
"eerie"
"unintentionally"
"appalling"
"keep_you"
"an_entertaining"
"and_entertaining"
"is_brilliant"
"not_good"
"definitely_worth"
"hype"
"miscast"
"cardboard"
"check_it"
"elsewhere"
"can_watch"
"guilt"
"very_entertaining"
"stick_to"
"doesn't_work"
"uninspired"
"lacked"
"hooked"
"unforgettable"
"would_love"
"bugs"
"this_crap"
"even_better"
"troubled"
"think_you"
"boredom"
"real_and"
"wasting"
"marvelous"
"courage"
"power_of"
"really_liked"
"existent"
"embarrassed"
"absolutely_nothing"
"exceptional"
"idiotic"
"gripping"
"ashamed"
"credibility"
"lazy"
"fabulous"
"chilling"
"carries"
"packed"
"obnoxious"
"performances_by"
"stupidity"
"thought_provoking"
"raw"
"screenwriter"
"inept"
"ludicrous"
"not_make"
"succeeds"
"great_but"
"loved_this"
"stay_away"
"twists_and"
"uninteresting"
"unconvincing"
"i_kept"
"bore"
"top_notch"
"nonetheless"
"and_funny"
"atrocious"
"sensitive"
"only_good"
"mildly"
"thank_you"
"than_any"
"remotely"
"would_recommend"
"no_other"
"alright"
"be_disappointed"
"urban"
"edge_of"
"is_beyond"
"appreciated"
"gritty"
"junk"
"just_too"
"liked_this"
"refreshing"
"forgettable"
"touches"
"just_doesn't"
"favorites"
"enjoyed_this"
"extraordinary"
"the_cover"
"for_everyone"
"highly_recommended"
"offensive"
"and_enjoy"
"entertaining_and"
"captures"
"satisfying"
"turkey"
"promising"
"asleep"
"just_didn't"
"haunting"
"doesn't_make"
"ruined"
"amateurish"
"warm"
"insult"
"pleasant"
"did_they"
"doesn't_even"
"subtitles"
"in_our"
"walked"
"was_too"
"avoid_this"
"very_bad"
"horribly"
"lousy"
"steals"
"embarrassing"
"tedious"
"well_written"
"be_funny"
"little_to"
"disgusting"
"great_job"
"traditional"
"enjoyed_it"
"rip_off"
"not_worth"
"just_not"
"of_fun"
"underrated"
"endless"
"brilliantly"
"delightful"
"through_this"
"not_funny"
"those_of"
"pretentious"
"shallow"
"unexpected"
"freedom"
"identity"
"ultimate"
"movie_just"
"unrealistic"
"dreadful"
"irritating"
"spectacular"
"fun_and"
"unfunny"
"well_worth"
"far_too"
"absolutely_no"
"dimensional"
"attempt_at"
"this_piece"
"about_as"
"quiet"
"not_enough"
"finest"
"crappy"
"so_well"
"bland"
"rubbish"
"saving"
"magnificent"
"highly_recommend"
"lacking"
"come_on"
"absurd"
"at_best"
"the_better"
"nonsense"
"love_it"
"loved_it"
"remarkable"
"below"
"friendship"
"unusual"
"treat"
"brutal"
"no_sense"
"problem_is"
"nicely"
"not_very"
"sit_through"
"wonderfully"
"a_copy"
"redeeming"
"tears"
"b_movie"
"watchable"
"what_makes"
"care_about"
"favourite"
"sucks"
"pleasure"
"some_kind"
"moved"
"way_too"
"wooden"
"just_plain"
"thin"
"whatsoever"
"tragic"
"and_white"
"impact"
"not_much"
"disaster"
"rented"
"and_well"
"mediocre"
"intense"
"gorgeous"
"christian"
"delivers"
"easy_to"
"ugly"
"funniest"
"impressed"
"lacks"
"gem"
"supposedly"
"i_first"
"very_little"
"cliché"
"really_good"
"very_funny"
"compelling"
"performance_as"
"a_fine"
"not_one"
"a_complete"
"confusing"
"i_recommend"
"fascinating"
"love_this"
"recommend_it"
"again_and"
"tired"
"stunning"
"disappointment"
"bad_movie"
"i_enjoyed"
"or_something"
"outstanding"
"hoping"
"great_movie"
"excuse"
"painful"
"unbelievable"
"touching"
"rare"
"suppose"
"pass"
"emotions"
"laughable"
"may_not"
"disappointing"
"terrific"
"innocent"
"complex"
"available"
"subtle"
"the_problem"
"beautifully"
"must_see"
"nowhere"
"a_must"
"edge"
"bother"
"glad"
"journey"
"surprisingly"
"grade"
"honestly"
"thanks"
"failed"
"much_as"
"genius"
"solid"
"garbage"
"well_done"
"barely"
"effective"
"awesome"
"your_time"
"trash"
"pathetic"
"a_true"
"pointless"
"recommended"
"too_many"
"as_good"
"appreciate"
"portrayal"
"bored"
"funny_and"
"plenty_of"
"sweet"
"sadly"
"incredible"
"to_believe"
"is_great"
"at_first"
"a_way"
"flat"
"pretty_good"
"potential"
"the_more"
"filmmakers"
"unlike"
"caught"
"same_time"
"back_in"
"might_have"
"is_good"
"good_as"
"deserves"
"fails"
"seen_it"
"wasted"
"brings"
"joke"
"a_bunch"
"that_would"
"and_how"
"powerful"
"dumb"
"unique"
"good_and"
"mess"
"i_liked"
"recommend_this"
"a_nice"
"badly"
"perfectly"
"masterpiece"
"superb"
"beauty"
"memorable"
"bunch_of"
"shame"
"lame"
"poorly"
"premise"
"weak"
"material"
"believable"
"much_better"
"so_bad"
"greatest"
"oscar"
"avoid"
"fantastic"
"realistic"
"okay"
"effort"
"sorry"
"tried"
"easy"
"surprised"
"dull"
"very_well"
"enjoyable"
"future"
"predictable"
"not_even"
"lack_of"
"cheap"
"basically"
"attention"
"apparently"
"disappointed"
"silly"
"ridiculous"
"annoying"
"watching_this"
"reality"
"crap"
"simple"
"looked"
"save"
"wonder"
"ok"
"hilarious"
"chance"
"lack"
"strong"
"better_than"
"experience"
"highly"
"should_have"
"decent"
"sometimes"
"very_good"
"favorite"
"brilliant"
"enjoyed"
"works"
"make_a"
"amazing"
"horrible"
"writing"
"see_it"
"heart"
"unfortunately"
"watch_it"
"waste"
"problem"
"supposed"
"loved"
"entertaining"
"worse"
"liked"
"definitely"
"perfect"
"wonderful"
"terrible"
"awful"
"truly"
"performances"
"stupid"
"classic"
"low"
"wrong"
"enjoy"
"boring"
"completely"
"poor"
"nice"
"excellent"
"the_worst"
"beautiful"
"true"
"different"
"a_little"
"worst"
"fun"
"performance"
"least"
"interesting"
"always"
"the_only"
"the_best"
"seems"
"world"
"quite"
"a_lot"
"nothing"
"watching"
"better"
"as_the"
"best"
"life"
"acting"
"plot"
"seen"
"don't"
"most"
"great"
"bad"
"see"
"very"
"good"
