"seven_out"
"torn_in"
"jbl"
"lombard's"
"evil_breed"
"reedus"
"brisk_pace"
"1_sound"
"lorenz"
"elvira_mistress"
"only_major"
"quite_disappointed"
"endearingly"
"sound_format"
"dvd_sleeve's"
"sleeve's"
"sleeve's_synopsis"
"lone_star"
"claptrap"
"costly"
"dull_moment"
"is_seven"
"no_bad"
"traffik"
"which_point"
"grade_c"
"only_negative"
"boring_or"
"uninvolving"
"the_factory"
"interminable"
"leaden"
"mansfield"
"watchable_but"
"blew_me"
"grade_b"
"negative_comments"
"lost_interest"
"wanting_more"
"me_sick"
"a_disgrace"
"bad_reviews"
"just_enjoy"
"little_else"
"mcdowell"
"his_grave"
"still_this"
"total_lack"
"blown_up"
"only_complaint"
"vapid"
"fine_film"
"unappealing"
"dvd_cover"
"something_better"
"2_from"
"only_saving"
"plus_side"
"grade_d"
"had_high"
"is_supposedly"
"deliciously"
"motions"
"letdown"
"excellently"
"what_exactly"
"absorbing"
"definitely_recommend"
"few_laughs"
"how_not"
"wider"
"ladder"
"wouldn't_recommend"
"neatly"
"not_recommended"
"turd"
"one_star"
"has_everything"
"tolerable"
"glued"
"looks_at"
"below_average"
"i_lost"
"just_wasn't"
"mystery_science"
"surprisingly_good"
"dirty_harry"
"wrenching"
"only_problem"
"thumbs_up"
"this_turkey"
"main_problem"
"9_out"
"hackneyed"
"unlikeable"
"yawn"
"be_missed"
"olds"
"muddled"
"bravo"
"i'm_afraid"
"doesn't_help"
"tiresome"
"sub_par"
"8_out"
"is_okay"
"3_out"
"baldwin"
"a_9"
"don't_miss"
"tripe"
"inappropriate"
"really_wanted"
"stilted"
"stock_footage"
"very_disappointed"
"7_out"
"bad_thing"
"riveting"
"just_isn't"
"was_disappointed"
"disappoint"
"downhill"
"an_enjoyable"
"little_film"
"shelf"
"can't_wait"
"it_tries"
"pleasantly_surprised"
"save_your"
"guys_and"
"not_recommend"
"4_out"
"unintentional"
"1_out"
"skip_this"
"fast_paced"
"ideal"
"walked_out"
"how_good"
"interesting_but"
"a_7"
"an_insult"
"stinker"
"unwatchable"
"a_4"
"first_rate"
"i_hated"
"disjointed"
"drivel"
"save_this"
"worthless"
"flawless"
"fears"
"insulting"
"pleased"
"that's_about"
"this_mess"
"was_looking"
"incoherent"
"superbly"
"cried"
"2_10"
"10_out"
"my_only"
"let_down"
"to_recommend"
"eerie"
"unintentionally"
"appalling"
"keep_you"
"an_entertaining"
"trite"
"and_entertaining"
"not_good"
"definitely_worth"
"hype"
"miscast"
"cardboard"
"check_it"
"very_entertaining"
"a_3"
"doesn't_work"
"uninspired"
"bible"
"lacked"
"hooked"
"unforgettable"
"would_love"
"this_crap"
"even_better"
"consequences"
"fast_forward"
"boredom"
"real_and"
"wasting"
"2_out"
"marvelous"
"courage"
"power_of"
"mst3k"
"existent"
"embarrassed"
"absolutely_nothing"
"film_just"
"best_part"
"exceptional"
"idiotic"
"gripping"
"ashamed"
"credibility"
"a_2"
"chilling"
"1_10"
"carries"
"obnoxious"
"3_10"
"stupidity"
"thought_provoking"
"raw"
"9_10"
"inept"
"ludicrous"
"not_make"
"great_but"
"loved_this"
"stay_away"
"twists_and"
"uninteresting"
"unconvincing"
"paint"
"i_kept"
"bore"
"top_notch"
"nonetheless"
"and_funny"
"atrocious"
"sensitive"
"only_good"
"mildly"
"thank_you"
"than_any"
"remotely"
"would_recommend"
"no_other"
"alright"
"be_disappointed"
"4_10"
"urban"
"edge_of"
"is_beyond"
"appreciated"
"gritty"
"junk"
"just_too"
"liked_this"
"refreshing"
"forgettable"
"touches"
"just_doesn't"
"favorites"
"seagal"
"enjoyed_this"
"of_war"
"extraordinary"
"the_cover"
"a_1"
"for_everyone"
"highly_recommended"
"offensive"
"the_boys"
"and_enjoy"
"entertaining_and"
"captures"
"this_thing"
"satisfying"
"turkey"
"promising"
"asleep"
"just_didn't"
"haunting"
"doesn't_make"
"7_10"
"ruined"
"amateurish"
"warm"
"insult"
"propaganda"
"pleasant"
"did_they"
"doesn't_even"
"subtitles"
"in_our"
"walked"
"8_10"
"avoid_this"
"very_bad"
"horribly"
"lousy"
"steals"
"embarrassing"
"tedious"
"well_written"
"be_funny"
"little_to"
"nevertheless"
"two_hours"
"i_watch"
"disgusting"
"great_job"
"enjoyed_it"
"rip_off"
"not_worth"
"just_not"
"of_fun"
"underrated"
"endless"
"brilliantly"
"delightful"
"through_this"
"first_saw"
"not_funny"
"pretentious"
"shallow"
"unexpected"
"freedom"
"identity"
"ultimate"
"movie_just"
"unrealistic"
"dreadful"
"irritating"
"spectacular"
"fun_and"
"unfunny"
"well_worth"
"far_too"
"a_look"
"absolutely_no"
"dimensional"
"attempt_at"
"this_piece"
"about_as"
"quiet"
"not_enough"
"finest"
"crappy"
"so_well"
"10_10"
"bland"
"rubbish"
"saving"
"highly_recommend"
"lacking"
"at_best"
"the_better"
"nonsense"
"love_it"
"vhs"
"loved_it"
"remarkable"
"below"
"friendship"
"unusual"
"treat"
"brutal"
"no_sense"
"problem_is"
"nicely"
"not_very"
"sit_through"
"wonderfully"
"a_copy"
"redeeming"
"tears"
"b_movie"
"animal"
"watchable"
"what_makes"
"favourite"
"sucks"
"pleasure"
"some_kind"
"moved"
"way_too"
"wooden"
"scientist"
"just_plain"
"thin"
"whatsoever"
"tragic"
"impact"
"not_much"
"disaster"
"rented"
"mediocre"
"intense"
"christian"
"ugly"
"adds"
"funniest"
"victims"
"paid"
"impressed"
"lacks"
"gem"
"supposedly"
"i_first"
"very_little"
"cliché"
"really_good"
"very_funny"
"compelling"
"to_all"
"noir"
"jean"
"performance_as"
"a_fine"
"not_one"
"a_complete"
"confusing"
"i_recommend"
"fascinating"
"love_this"
"recommend_it"
"again_and"
"tired"
"stunning"
"disappointment"
"bad_movie"
"i_enjoyed"
"or_something"
"outstanding"
"hoping"
"great_movie"
"excuse"
"painful"
"unbelievable"
"touching"
"rare"
"suppose"
"pass"
"emotions"
"laughable"
"may_not"
"disappointing"
"terrific"
"innocent"
"complex"
"available"
"subtle"
"the_problem"
"beautifully"
"must_see"
"nowhere"
"a_must"
"edge"
"bother"
"glad"
"journey"
"surprisingly"
"honestly"
"thanks"
"failed"
"accent"
"genius"
"80_s"
"solid"
"garbage"
"well_done"
"if_this"
"barely"
"it_again"
"effective"
"awesome"
"trash"
"pathetic"
"a_true"
"pointless"
"from_his"
"recommended"
"i_remember"
"too_many"
"as_good"
"producers"
"i_believe"
"than_this"
"appreciate"
"portrayal"
"neither"
"not_that"
"bored"
"funny_and"
"plenty_of"
"sweet"
"sadly"
"van"
"incredible"
"to_believe"
"is_great"
"at_first"
"a_way"
"flat"
"pretty_good"
"potential"
"unlike"
"for_those"
"caught"
"same_time"
"back_in"
"might_have"
"is_good"
"good_as"
"deserves"
"fails"
"seen_it"
"wasted"
"and_their"
"look_like"
"believe_that"
"brings"
"joke"
"a_bunch"
"that_would"
"and_how"
"powerful"
"dumb"
"unique"
"good_and"
"mess"
"on_dvd"
"writers"
"keeps"
"read_the"
"i_liked"
"recommend_this"
"a_nice"
"badly"
"perfectly"
"none_of"
"what_was"
"masterpiece"
"superb"
"beauty"
"it's_just"
"otherwise"
"memorable"
"write"
"unless"
"season"
"bunch_of"
"lame"
"poorly"
"first_time"
"premise"
"atmosphere"
"what_it"
"9"
"weak"
"material"
"believable"
"much_better"
"so_bad"
"rent"
"8"
"greatest"
"oscar"
"avoid"
"fantastic"
"realistic"
"okay"
"7"
"tale"
"looks_like"
"effort"
"ways"
"sorry"
"easy"
"surprised"
"dull"
"release"
"any_of"
"very_well"
"enjoyable"
"it_just"
"if_i"
"future"
"predictable"
"not_even"
"of_what"
"tells"
"moving"
"at_times"
"was_just"
"episodes"
"lack_of"
"jack"
"cheap"
"basically"
"attention"
"apparently"
"disappointed"
"saw_this"
"silly"
"ridiculous"
"light"
"relationship"
"annoying"
"as_if"
"watching_this"
"today"
"if_it"
"reality"
"i_mean"
"attempt"
"story_of"
"obvious"
"crap"
"simple"
"looked"
"wouldn't"
"save"
"wonder"
"ok"
"hilarious"
"chance"
"strong"
"better_than"
"experience"
"you_want"
"except"
"did_not"
"highly"
"should_have"
"decent"
"city"
"sometimes"
"very_good"
"favorite"
"brilliant"
"enjoyed"
"tries"
"works"
"make_a"
"amazing"
"horrible"
"writing"
"see_it"
"heart"
"i_could"
"with_this"
"you_will"
"4"
"unfortunately"
"the_book"
"watch_it"
"guess"
"example"
"lives"
"seemed"
"waste"
"and_is"
"problem"
"supposed"
"loved"
"entertaining"
"worse"
"liked"
"there_was"
"oh"
"couldn't"
"that_was"
"they_were"
"gives"
"definitely"
"the_director"
"often"
"for_this"
"perfect"
"episode"
"film_and"
"human"
"wonderful"
"is_just"
"mean"
"terrible"
"it_has"
"women"
"awful"
"truly"
"performances"
"but_this"
"stupid"
"classic"
"low"
"wrong"
"camera"
"enjoy"
"boring"
"3"
"either"
"could_have"
"completely"
"poor"
"the_original"
"nice"
"1"
"death"
"at_all"
"idea"
"is_an"
"excellent"
"a_bit"
"the_worst"
"himself"
"movie_was"
"beautiful"
"takes"
"later"
"half"
"instead"
"someone"
"war"
"together"
"job"
"wasn't"
"money"
"true"
"looks"
"reason"
"it's_a"
"different"
"shows"
"is_one"
"maybe"
"the_way"
"dvd"
"trying"
"like_a"
"would_have"
"especially"
"although"
"our"
"looking"
"a_little"
"played"
"each"
"worst"
"fun"
"some_of"
"and_it"
"performance"
"2"
"family"
"anything"
"minutes"
"script"
"least"
"interesting"
"a_movie"
"always"
"times"
"i_think"
"music"
"the_only"
"to_make"
"series"
"may"
"own"
"both"
"the_best"
"seems"
"world"
"quite"
"us"
"a_lot"
"new"
"director"
"makes"
"nothing"
"have_been"
"didn't"
"years"
"doesn't"
"actors"
"thing"
"watching"
"should"
"why"
"still"
"better"
"as_the"
"off"
"best"
"life"
"acting"
"plot"
"love"
"seen"
"at_the"
"any"
"make"
"one_of"
"don't"
"most"
"him"
"also"
"will"
"great"
"do"
"bad"
"this_is"
"it_is"
"well"
"can"
"see"
"only"
"to_be"
"to_the"
"would"
"even"
"my"
"time"
"no"
"is_a"
"and_the"
"very"
"more"
"good"
"has"
"it's"
